'use strict';

// Напиши функцию logItems(array), которая получает массив и использует цикл for, который для каждого элемента массива
// будет выводить в консоль сообщение в формате [номер элемента] - [значение элемента].
// Нумерация должна начинаться с 1. К примеру для первого элемента массива ['Mango', 'Poly', 'Ajax'] с индексом 0 будет
// выведено '1 - Mango', а для индекса 2 выведет '3 - Ajax'.

// 1. написати цикл +
// 2. засунути в функцію +
// 3. превірити працездатність +

const arrayOutput = function(array) {
  let arrCount = array.length;

  for (let i = 0; i < arrCount; i++) {
    console.log(`${i + 1} - ${array[i]}`);
  }
};

arrayOutput(['Mango', 'Poly', 'Ajax', 'Lux', 'Jay', 'Kong']);
arrayOutput([5, 10, 15, 20, 25, 30, 35, 40, 45, 50]);
